app/controllers/admin/sessions_controller.rb

SELECT "administrators".* FROM "administrators" WHERE (LOWER(email) = 'hanako@example.com') LIMIT $1  [["LIMIT", 1]]
---
    def create
        @form = Admin::LoginForm.new(login_form_params)
        if @form.email.present?
            administrator =
                Administrator.find_by("LOWER(email) = ?", @form.email.downcase)