app/controllers/admin/staff_members_controller.rb

SELECT "staff_members".* FROM "staff_members" ORDER BY "staff_members"."family_name_kana" ASC, "staff_members"."given_name_kana" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "staff_members"
---
    def index
        @staff_members = StaffMember.order(:family_name_kana, :given_name_kana)
            .page(params[:page])

SELECT "staff_members".* FROM "staff_members" WHERE "staff_members"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def edit
        @staff_member = StaffMember.find(params[:id])

INSERT INTO "staff_members" ("email", "family_name", "given_name", "family_name_kana", "given_name_kana", "hashed_password", "start_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @staff_member = StaffMember.new(staff_member_params)
        if @staff_member.save

SELECT "staff_members".* FROM "staff_members" WHERE "staff_members"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "staff_members" SET "start_date" = $1, "end_date" = $2, "updated_at" = $3 WHERE "staff_members"."id" = $4  [["start_date", "1999-12-31"], ["end_date", "2100-01-01"], ["updated_at", "2020-04-16 04:47:31.590930"], ["id", 11]]
---
    def update
        @staff_member = StaffMember.find(params[:id])
        @staff_member.assign_attributes(staff_member_params)
        if @staff_member.save