app/controllers/staff/base.rb


    private def current_staff_member
        if session[:staff_member_id]
            @current_staff_member ||=
                StaffMember.find_by(id: session[:staff_member_id])
---
SELECT "staff_members".* FROM "staff_members" WHERE "staff_members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]